zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXC/MCXC041/MCXC041_COMMON.h
/* SPI - Peripheral instance base addresses */
/** Peripheral SPI0 base address */
#define SPI0_BASE                                (0x40076000u)
/** Peripheral SPI0 base pointer */
#define SPI0                                     ((SPI_Type *)SPI0_BASE)
/** Array initializer of SPI peripheral base addresses */
#define SPI_BASE_ADDRS                           { SPI0_BASE }
/** Array initializer of SPI peripheral base pointers */
#define SPI_BASE_PTRS                            { SPI0 }
/** Interrupt vectors for the SPI peripheral type */
#define SPI_IRQS                                 { SPI0_IRQn }

/* TPM - Peripheral instance base addresses */
/** Peripheral TPM0 base address */
#define TPM0_BASE                                (0x40038000u)
/** Peripheral TPM0 base pointer */
#define TPM0                                     ((TPM_Type *)TPM0_BASE)
/** Peripheral TPM1 base address */
#define TPM1_BASE                                (0x40039000u)
/** Peripheral TPM1 base pointer */
#define TPM1                                     ((TPM_Type *)TPM1_BASE)
/** Array initializer of TPM peripheral base addresses */
#define TPM_BASE_ADDRS                           { TPM0_BASE, TPM1_BASE }
/** Array initializer of TPM peripheral base pointers */
#define TPM_BASE_PTRS                            { TPM0, TPM1 }
/** Interrupt vectors for the TPM peripheral type */
#define TPM_IRQS                                 { TPM0_IRQn, TPM1_IRQn }

/* VREF - Peripheral instance base addresses */
/** Peripheral VREF base address */
#define VREF_BASE                                (0x40074000u)
/** Peripheral VREF base pointer */
#define VREF                                     ((VREF_Type *)VREF_BASE)
/** Array initializer of VREF peripheral base addresses */
#define VREF_BASE_ADDRS                          { VREF_BASE }
/** Array initializer of VREF peripheral base pointers */
#define VREF_BASE_PTRS                           { VREF }

/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field ## _SHIFT)) & (field ## _MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field ## _MASK)) >> (field ## _SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

#define I2C_S1_REG(base)                  I2C_S_REG(base)
#define I2C_S1_RXAK_MASK                  I2C_S_RXAK_MASK
#define I2C_S1_RXAK_SHIFT                 I2C_S_RXAK_SHIFT
#define I2C_S1_IICIF_MASK                 I2C_S_IICIF_MASK
#define I2C_S1_IICIF_SHIFT                I2C_S_IICIF_SHIFT
#define I2C_S1_SRW_MASK                   I2C_S_SRW_MASK
#define I2C_S1_SRW_SHIFT                  I2C_S_SRW_SHIFT
#define I2C_S1_RAM_MASK                   I2C_S_RAM_MASK
#define I2C_S1_RAM_SHIFT                  I2C_S_RAM_SHIFT
#define I2C_S1_ARBL_MASK                  I2C_S_ARBL_MASK
#define I2C_S1_ARBL_SHIFT                 I2C_S_ARBL_SHIFT
#define I2C_S1_BUSY_MASK                  I2C_S_BUSY_MASK
#define I2C_S1_BUSY_SHIFT                 I2C_S_BUSY_SHIFT
#define I2C_S1_IAAS_MASK                  I2C_S_IAAS_MASK
#define I2C_S1_IAAS_SHIFT                 I2C_S_IAAS_SHIFT
#define I2C_S1_TCF_MASK                   I2C_S_TCF_MASK
#define I2C_S1_TCF_SHIFT                  I2C_S_TCF_SHIFT
#define I2C0_S1                           I2C0_S
#define I2C_FLT_STOPIE_MASK               This_symbol_has_been_deprecated
#define I2C_FLT_STOPIE_SHIFT              This_symbol_has_been_deprecated
#define MCG_HCTRIM_COARSE_TRIM_MASK       This_symbol_has_been_deprecated
#define MCG_HCTRIM_COARSE_TRIM_SHIFT      This_symbol_has_been_deprecated
#define MCG_HCTRIM_COARSE_TRIM(x)         This_symbol_has_been_deprecated
#define MCG_HTTRIM_TEMPCO_TRIM_MASK       This_symbol_has_been_deprecated
#define MCG_HTTRIM_TEMPCO_TRIM_SHIFT      This_symbol_has_been_deprecated
#define MCG_HTTRIM_TEMPCO_TRIM(x)         This_symbol_has_been_deprecated
#define MCG_HFTRIM_FINE_TRIM_MASK         This_symbol_has_been_deprecated
#define MCG_HFTRIM_FINE_TRIM_SHIFT        This_symbol_has_been_deprecated
#define MCG_HFTRIM_FINE_TRIM(x)           This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_STRIMRNG_MASK        This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_STRIMRNG_SHIFT       This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_STRIMRNG(x)          This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_FTRIMRNG_MASK        This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_FTRIMRNG_SHIFT       This_symbol_has_been_deprecated
#define MCG_LTRIMRNG_FTRIMRNG(x)          This_symbol_has_been_deprecated
#define MCG_LFTRIM_LIRC_FTRIM_MASK        This_symbol_has_been_deprecated
#define MCG_LFTRIM_LIRC_FTRIM_SHIFT       This_symbol_has_been_deprecated
#define MCG_LFTRIM_LIRC_FTRIM(x)          This_symbol_has_been_deprecated
#define MCG_LSTRIM_LIRC_STRIM_MASK        This_symbol_has_been_deprecated
#define MCG_LSTRIM_LIRC_STRIM_SHIFT       This_symbol_has_been_deprecated
#define MCG_LSTRIM_LIRC_STRIM(x)          This_symbol_has_been_deprecated
#define PTA_BASE                          GPIOA_BASE
#define PTB_BASE                          GPIOB_BASE
#define PTA                               GPIOA
#define PTB                               GPIOB
#define FPTA_BASE                         FGPIOA_BASE
#define FPTB_BASE                         FGPIOB_BASE
#define FPTA                              FGPIOA
#define FPTB                              FGPIOB

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* MCXC041_COMMON_H_ */

